using System.Collections.Generic;

namespace KIP_server_NoAuth.Constants
{
    /// <summary>
    /// Short names for building constants.
    /// </summary>
    public static class BuildingShortNames
    {
        /// <summary>
        /// Gets short names of building.
        /// </summary>
        public static Dictionary<string, string> ShortNames { get; } = new Dictionary<string, string>
        {
            { "Учбовий корпус 1", "У1" },
            { "Учбовий корпус 2", "У2" },
            { "Учбовий корпус 3", "У3" },
            { "Учбовий корпус 4", "У4" },
            { "Учбовий корпус 5", "У5" },
            { "Головний аудіторний корпус", "ГАК" },
            { "Хімічний корпус", "ХК" },
            { "Лабораторний корпус", "ЛК" },
            { "Лабораторний корпус 3", "ЛК3" },
            { "Інженерний корпус", "ІК" },
            { "Електротехнічний корпус", "ЕК" },
            { "Технічний корпус", "ТК" },
            { "Технічний корпус 2", "ТК2" },
            { "Радіо корпус", "РК" },
            { "Математичний корпус", "МК" },
            { "Адміністративно-господарський корпус", "АК" },
            { "Головний корпус", "ГК" },
            { "Вечірний корпус", "ВК" },
            { "Фізичний корпус", "ФК" },
            { "Кафедра української мови", "КУМ" },
            { "Спорткомплекс", "СК" },
            { "ХКТ Колледж", "ХКТ" },
            { "Завод ФЕД", "ФЕД" },
            { "каф.ХТПЕ", "ХТПЕ" },
            { "каф.ТПКМ", "ТПКМ" },
            { "Кафедра турбінобудування", "КТ" },
            { "Інститут проблем машинобудування", "ІПМ" },
            { "Багалія-13", "Б13" },
            { "Профілакторій", "П" },
        };
    }
}
